# Pandas

In [170]:
import numpy as np

In [171]:
import pandas as pd

In [3]:
labels = ['a', 'b', 'c', 'd']
labels

['a', 'b', 'c', 'd']

In [4]:
lists = [10,28,3,4]
lists

[10, 28, 3, 4]

In [5]:
array=np.array([1,2,3,4])
array

array([1, 2, 3, 4])

In [7]:
dict={'w':10,'x':20,'y':30,'z':40}
dict

{'w': 10, 'x': 20, 'y': 30, 'z': 40}

In [12]:
pd.Series(lists)

0    10
1    28
2     3
3     4
dtype: int64

In [17]:
pd1 = pd.Series(lists, index=labels)
pd1

a    10
b    28
c     3
d     4
dtype: int64

In [18]:
pd.Series(labels, lists)

10    a
28    b
3     c
4     d
dtype: object

In [19]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

# Pandas DataFrame & Indexing

In [20]:
sports1=pd.Series([1,2,3,4], index=['Cricket','Football','Basketball','Golf'])
sports1

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [21]:
sports1['Cricket']

1

In [22]:
sports1['Basketball']

3

In [23]:
sports2=pd.Series([11,13,12,4], index=['Cricket','Football','Baseball','Golf'])
sports2

Cricket     11
Football    13
Baseball    12
Golf         4
dtype: int64

In [24]:
sports2['Baseball']

12

In [25]:
sports1 + sports2

Baseball       NaN
Basketball     NaN
Cricket       12.0
Football      15.0
Golf           8.0
dtype: float64

In [27]:
####---------------------------####

In [43]:
df1=pd.DataFrame(np.random.rand(8,8), index='A B C D E F G H'.split(), columns='Score1 Score2 Score3 Score4 Score5 Score6 Score7 Score8'.split())
df1

,Score1,Score2,Score3,Score4,Score5,Score6,Score7,Score8
A,0.770608,0.564835,0.873280,0.749592,0.747555,0.380360,0.350730,0.418518
B,0.355569,0.561978,0.603252,0.207934,0.351345,0.720367,0.320310,0.669432
C,0.666158,0.531444,0.011123,0.865352,0.051146,0.497606,0.970297,0.121884
D,0.902028,0.112444,0.399784,0.803395,0.185986,0.566231,0.702889,0.368090
E,0.536721,0.071864,0.542998,0.005937,0.306200,0.503585,0.250852,0.181800
F,0.890910,0.813718,0.827263,0.543654,0.543070,0.134515,0.768092,0.091288
G,0.414949,0.889967,0.593461,0.172420,0.630474,0.994949,0.281503,0.790456
H,0.591145,0.708456,0.370468,0.637898,0.331913,0.652294,0.153092,0.335025

In [44]:
df1['Score3']

A    0.873280
B    0.603252
C    0.011123
D    0.399784
E    0.542998
F    0.827263
G    0.593461
H    0.370468
Name: Score3, dtype: float64

In [46]:
df1[['Score2','Score1','Score5']]

     Score2    Score1    Score5
A  0.564835  0.770608  0.747555
B  0.561978  0.355569  0.351345
C  0.531444  0.666158  0.051146
D  0.112444  0.902028  0.185986
E  0.071864  0.536721  0.306200
F  0.813718  0.890910  0.543070
G  0.889967  0.414949  0.630474
H  0.708456  0.591145  0.331913

In [47]:
df1=pd.DataFrame(np.random.rand(8,5), index='A B C D E F G H'.split(), columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.040935  0.882326  0.452416  0.214952  0.009552
B  0.621348  0.936240  0.702210  0.346214  0.097314
C  0.306203  0.057219  0.317122  0.571031  0.349189
D  0.762555  0.998685  0.910156  0.443058  0.830726
E  0.045107  0.343736  0.383136  0.071474  0.590557
F  0.855582  0.785849  0.821196  0.098403  0.455519
G  0.134680  0.455071  0.397887  0.341893  0.026926
H  0.390453  0.256222  0.453655  0.694296  0.560875

In [48]:
df1['Score6'] = df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.040935  0.882326  0.452416  0.214952  0.009552  0.923261
B  0.621348  0.936240  0.702210  0.346214  0.097314  1.557589
C  0.306203  0.057219  0.317122  0.571031  0.349189  0.363422
D  0.762555  0.998685  0.910156  0.443058  0.830726  1.761239
E  0.045107  0.343736  0.383136  0.071474  0.590557  0.388843
F  0.855582  0.785849  0.821196  0.098403  0.455519  1.641431
G  0.134680  0.455071  0.397887  0.341893  0.026926  0.589751
H  0.390453  0.256222  0.453655  0.694296  0.560875  0.646675

In [49]:
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.040935  0.882326  0.452416  0.214952  0.009552  0.923261
B  0.621348  0.936240  0.702210  0.346214  0.097314  1.557589
C  0.306203  0.057219  0.317122  0.571031  0.349189  0.363422
D  0.762555  0.998685  0.910156  0.443058  0.830726  1.761239
E  0.045107  0.343736  0.383136  0.071474  0.590557  0.388843
F  0.855582  0.785849  0.821196  0.098403  0.455519  1.641431
G  0.134680  0.455071  0.397887  0.341893  0.026926  0.589751
H  0.390453  0.256222  0.453655  0.694296  0.560875  0.646675

In [51]:
df1.drop('Score5', axis=1)

     Score1    Score2    Score3    Score4    Score6
A  0.040935  0.882326  0.452416  0.214952  0.923261
B  0.621348  0.936240  0.702210  0.346214  1.557589
C  0.306203  0.057219  0.317122  0.571031  0.363422
D  0.762555  0.998685  0.910156  0.443058  1.761239
E  0.045107  0.343736  0.383136  0.071474  0.388843
F  0.855582  0.785849  0.821196  0.098403  1.641431
G  0.134680  0.455071  0.397887  0.341893  0.589751
H  0.390453  0.256222  0.453655  0.694296  0.646675

In [53]:
df1.drop('E', axis=0)

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.040935  0.882326  0.452416  0.214952  0.009552  0.923261
B  0.621348  0.936240  0.702210  0.346214  0.097314  1.557589
C  0.306203  0.057219  0.317122  0.571031  0.349189  0.363422
D  0.762555  0.998685  0.910156  0.443058  0.830726  1.761239
F  0.855582  0.785849  0.821196  0.098403  0.455519  1.641431
G  0.134680  0.455071  0.397887  0.341893  0.026926  0.589751
H  0.390453  0.256222  0.453655  0.694296  0.560875  0.646675

In [55]:
df1.drop('H')

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.040935  0.882326  0.452416  0.214952  0.009552  0.923261
B  0.621348  0.936240  0.702210  0.346214  0.097314  1.557589
C  0.306203  0.057219  0.317122  0.571031  0.349189  0.363422
D  0.762555  0.998685  0.910156  0.443058  0.830726  1.761239
E  0.045107  0.343736  0.383136  0.071474  0.590557  0.388843
F  0.855582  0.785849  0.821196  0.098403  0.455519  1.641431
G  0.134680  0.455071  0.397887  0.341893  0.026926  0.589751

In [56]:
df2=pd.DataFrame(np.random.randint(0,15), index='A B C D E F G H'.split(), columns='Score1 Score2 Score3 Score4 Score5 Score6 Score7 Score8'.split())
df2

   Score1  Score2  Score3  Score4  Score5  Score6  Score7  Score8
A       4       4       4       4       4       4       4       4
B       4       4       4       4       4       4       4       4
C       4       4       4       4       4       4       4       4
D       4       4       4       4       4       4       4       4
E       4       4       4       4       4       4       4       4
F       4       4       4       4       4       4       4       4
G       4       4       4       4       4       4       4       4
H       4       4       4       4       4       4       4       4

In [59]:
df3={'ID':[101,102,103,107,176], 'Name':['John','Mercy','Akash','Kavin','Lally'], 
    'Profit':[20,54,56,87,123]}
df=pd.DataFrame(df3)
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [72]:
df.drop('ID', axis=1)

    Name  Profit
0   John      20
1  Mercy      54
2  Akash      56
3  Kavin      87
4  Lally     123

In [73]:
df.drop(3)

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
4  176  Lally     123

In [74]:
df['Name']

0     John
1    Mercy
2    Akash
3    Kavin
4    Lally
Name: Name, dtype: object

In [75]:
df[['Name','ID']]

    Name   ID
0   John  101
1  Mercy  102
2  Akash  103
3  Kavin  107
4  Lally  176

In [76]:
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

## --- Assignment with Kishan --##

In [77]:
# 1. Create  1-D array(series ) in pandas.

list1=[1,2,3]
arr1 = pd.Series(list1)
arr1

0    1
1    2
2    3
dtype: int64

In [87]:
# Create a pandas series from a list .

list1=[1,2,3,4,5]
arra2=pd.Series(list1, index = ("a","b","c","d","e"))
arra2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [88]:
# Create a pandas series with user define index.

data=np.array(['a','b','c','d'])
indx=[100,101,102,103]

df=pd.DataFrame(data,index=indx)
df

     0
100  a
101  b
102  c
103  d

In [89]:
row_labels=['zeroth_row','first_row','second_row','third_row','fourth_row']

a=[5,2,7,4,1]     # create a list 

v=pd.Series(data=a,index=row_labels)
v

zeroth_row    5
first_row     2
second_row    7
third_row     4
fourth_row    1
dtype: int64

In [92]:
# Write a program to create Dataframe by Dictionay .

Dict={
    'Name':['KRish',"Krishan","Ram"],
    'age':[25,23,34]
}

df2 = pd.DataFrame(Dict)
df2

      Name  age
0    KRish   25
1  Krishan   23
2      Ram   34

In [97]:
dict1={"name":["Vikas","Aneya","Nilambari"],
       "Age":[37,35,8]}
df=pd.DataFrame(dict1)
df

   Age       name
0   37      Vikas
1   35      Aneya
2    8  Nilambari

In [140]:
## This one not working -- now working, used zip function 

dict_numbers={1,2,3,4,5}   #set datatype 

dict_marks={85,45,96,97,37}

df = pd.DataFrame(list(zip(dict_numbers,dict_marks)))
df

   0   1
0  1  96
1  2  97
2  3  45
3  4  85
4  5  37

In [98]:
# Create DataFrame and put index
data = np.array(['a','b','c','d']) #series 

index=[100,101,102,103] #list of index

df = pd.DataFrame(data, index = index)
df

     0
100  a
101  b
102  c
103  d

In [102]:
# Accessing Data from Series with Position

s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
s
s['c']

3

In [103]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [104]:
s['d']

4

In [105]:
Dict={
    'Name':['KRish',"Krishan","Ram",'Pallab','Raj'],
    'Age':[25,23,34,32,23],
    'Height':[5,6,5.5,6,5.9]
}
df=pd.DataFrame(Dict)
print(df)

   Age  Height     Name
0   25     5.0    KRish
1   23     6.0  Krishan
2   34     5.5      Ram
3   32     6.0   Pallab
4   23     5.9      Raj

In [106]:
df.iloc[0:2,]         #print First two rows

   Age  Height     Name
0   25     5.0    KRish
1   23     6.0  Krishan

In [107]:
df.iloc[1:3,0:2]     #print second and 3rd row and 1and 2nd col

   Age  Height
1   23     6.0
2   34     5.5

In [109]:
df

   Age  Height     Name
0   25     5.0    KRish
1   23     6.0  Krishan
2   34     5.5      Ram
3   32     6.0   Pallab
4   23     5.9      Raj

In [108]:
df.iloc[2:4,1:3]

   Height    Name
2     5.5     Ram
3     6.0  Pallab

In [110]:
df.iloc[1:3,0:3:2]

   Age     Name
1   23  Krishan
2   34      Ram

In [111]:
df.iloc[1:3,[-1]]

      Name
1  Krishan
2      Ram

In [113]:
# convert 3,4 numpy array into data frame

arr1 = np.array(([1,2,3,4],[5,6,7,8],[9,10,11,12]))

df=pd.DataFrame(arr1)
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [143]:
# convert 3,4 numpy array into data frame

data = np.random.rand(3,4)
df=pd.DataFrame(data)
df

          0         1         2         3
0  0.737796  0.946794  0.985629  0.342341
1  0.850938  0.819566  0.987362  0.472267
2  0.617400  0.659766  0.413946  0.991875

In [144]:
# Change the column name - when all column names needs to be changed 

df.columns=["name","roll","marks","add"]
df

       name      roll     marks       add
0  0.737796  0.946794  0.985629  0.342341
1  0.850938  0.819566  0.987362  0.472267
2  0.617400  0.659766  0.413946  0.991875

In [145]:
# rename the column name - when all column name change is not required. 

df.rename(columns = {'add':'newAdd'}, inplace = False)

       name      roll     marks    newAdd
0  0.737796  0.946794  0.985629  0.342341
1  0.850938  0.819566  0.987362  0.472267
2  0.617400  0.659766  0.413946  0.991875

In [146]:
df.columns=['newName','newRoll','newMarks','newAdd']
df

    newName   newRoll  newMarks    newAdd
0  0.737796  0.946794  0.985629  0.342341
1  0.850938  0.819566  0.987362  0.472267
2  0.617400  0.659766  0.413946  0.991875

In [147]:
# use of zip function 

l1=[1,2,3,4,5]
l2=[6,7,8,9,7]
l3=["ram","kishan","Sunny"]
df5=pd.DataFrame(list(zip(l1,l2,l3)))  # convert list into touple, then into data frame
df5

   0  1       2
0  1  6     ram
1  2  7  kishan
2  3  8   Sunny

In [38]:
arr1 = np.random.randint(100,size=(10,3))
df7=pd.DataFrame(arr1, columns=["Sci_Mark","hindi","English"])
df7

   Sci_Mark  hindi  English
0        74     48       17
1        43     44       74
2        49     47       29
3        63     92       50
4        45     39       64
5        17     71       99
6        10     20       29
7        51     42       26
8        13     21       67
9         5     64       13

In [151]:
# taking array and creating Data Frame

arr1 = np.random.randint(100, size=(10,3))
df10 = pd.DataFrame(arr1, columns=["ScienceMarks", "Hindi", "English"])
df10

   ScienceMarks  Hindi  English
0            75     55       37
1            24     76       14
2            18     81       70
3            96      6        4
4            29     89       90
5            43     27       90
6            83     91       57
7            18     22        2
8             9     92       49
9            72     58       15

In [153]:
df10.iloc[4:,1:]

   Hindi  English
4     89       90
5     27       90
6     91       57
7     22        2
8     92       49
9     58       15

In [154]:
# Quection of replacing a value

In [160]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David',
'Gasper','Betina','Andres']),
'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,"Krish",46]),
'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}


df = pd.DataFrame(d)
df

      Age    Name  Rating
0      25     Tom    4.23
1      26   James    3.24
2      25   Ricky    3.98
3      23     Vin    2.56
4      30   Steve    3.20
5      29   Smith    4.60
6      23    Jack    3.80
7      34     Lee    3.78
8      40   David    2.98
9      30  Gasper    4.80
10  Krish  Betina    4.10
11     46  Andres    3.65

In [161]:
df['Age'].replace('Krish',100, regex=True)

0      25
1      26
2      25
3      23
4      30
5      29
6      23
7      34
8      40
9      30
10    100
11     46
Name: Age, dtype: int64

In [162]:
df

      Age    Name  Rating
0      25     Tom    4.23
1      26   James    3.24
2      25   Ricky    3.98
3      23     Vin    2.56
4      30   Steve    3.20
5      29   Smith    4.60
6      23    Jack    3.80
7      34     Lee    3.78
8      40   David    2.98
9      30  Gasper    4.80
10  Krish  Betina    4.10
11     46  Andres    3.65

In [159]:
df['Age'] = df['Age'].replace('Krish',100)
df

    Age    Name  Rating
0    25     Tom    4.23
1    26   James    3.24
2    25   Ricky    3.98
3    23     Vin    2.56
4    30   Steve    3.20
5    29   Smith    4.60
6    23    Jack    3.80
7    34     Lee    3.78
8    40   David    2.98
9    30  Gasper    4.80
10  100  Betina    4.10
11   46  Andres    3.65

In [184]:
# Create a DataFrame in which you have 2 columns(Name , Age) . And fill the data into this columns and use user define index

dict11 = {'Name':['Arun','Barun','Krish'],
            'Age':[24,30,45]}
df11 = pd.DataFrame(dict11, index=[15,11,24])
df11

    Age   Name
15   24   Arun
11   30  Barun
24   45  Krish

In [185]:
#Read the Csv/Excel file and convert it into DataFrame

user = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep = '|')
user

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
5          6   42      M      executive    98101
6          7   57      M  administrator    91344
7          8   36      M  administrator    05201
8          9   29      M        student    01002
9         10   53      M         lawyer    90703
10        11   39      F          other    30329
11        12   28      F          other    06405
12        13   47      M       educator    29206
13        14   45      M      scientist    55106
14        15   49      F       educator    97301
15        16   21      M  entertainment    10309
16        17   30      M     programmer    06355
17        18   35      F          other    37212
18        19   40      M      librarian    02138
19        20   42      F      homemaker    95660
20        21   26      M         writer    30068
21        22   25      M         writer    40206
22        23   30      F         artist    48197
23        24   21      F         artist    94533
24        25   39      M       engineer    55107
25        26   49      M       engineer    21044
26        27   40      F      librarian    30030
27        28   32      M         writer    55369
28        29   41      M     programmer    94043
29        30    7      M        student    55436
..       ...  ...    ...            ...      ...
913      914   44      F          other    08105
914      915   50      M  entertainment    60614
915      916   27      M       engineer    N2L5N
916      917   22      F        student    20006
917      918   40      M      scientist    70116
918      919   25      M          other    14216
919      920   30      F         artist    90008
920      921   20      F        student    98801
921      922   29      F  administrator    21114
922      923   21      M        student    E2E3R
923      924   29      M          other    11753
924      925   18      F       salesman    49036
925      926   49      M  entertainment    01701
926      927   23      M     programmer    55428
927      928   21      M        student    55408
928      929   44      M      scientist    53711
929      930   28      F      scientist    07310
930      931   60      M       educator    33556
931      932   58      M       educator    06437
932      933   28      M        student    48105
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [186]:
# Print the top 5 and last 5 rows of the DataFrame

user.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [187]:
user.tail(5)

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [189]:
# write a program to print 3 Row of the DataFrame 

user.iloc[:3,]

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

In [192]:
# Write a Program to print First two Columns of the DataFrame.
# to make it short i am taking only 2 rows 

user.iloc[0:2,:2]

   user_id  age
0        1   24
1        2   53

In [193]:
# Write a Program to filter the DataFrame and print First 2 row and first two column of the DataFrame.

user.iloc[0:2,:2]

   user_id  age
0        1   24
1        2   53

In [207]:
# Write a Program to Find the Null/missing value in the DataFrame.

#user[user['zip_code'].isnull()]

#user.isnull()

user.isnull().sum()

user_id       0
age           0
gender        0
occupation    0
zip_code      0
dtype: int64

In [203]:
# Create DataFrame from dict and list

Dict={
    'Name':['KRish',"Krishan","Ram",'Pallab','Raj'],
    'Age':[25,23,34,32,23],
    'Height':[5,6,5.5,6,5.9]
}
df=pd.DataFrame(Dict)
print(df)

   Age  Height     Name
0   25     5.0    KRish
1   23     6.0  Krishan
2   34     5.5      Ram
3   32     6.0   Pallab
4   23     5.9      Raj

In [204]:
l1=[1,2,3,4,5]
l2=[6,7,8,9,7]
l3=["ram","kishan","Sunny"]
df5=pd.DataFrame(list(zip(l1,l2,l3)))  # convert list into touple, then into data frame
df5

   0  1       2
0  1  6     ram
1  2  7  kishan
2  3  8   Sunny

In [ ]:
# Write a Program to drop the rows which has null value.

In [ ]:
# Write a Program to remove Duplicate values in a Dataframe.